#ifndef _AU9110_COX_BASE_H_
#define _AU9110_COX_BASE_H_

#include "lowlayer.h"
#include "sysctl.h"
#include "gpio.h"
//#include "uart.h"
//#include "spi.h"
//#include "i2c.h"
#include "rtc.h"
//#include "timer.h"
//#include "pwm.h"
//#include "dma.h"
//#include "adc.h"
//#include "acmp.h"
//#include "wdt.h"

//*****************************************************************************
//
//! \addtogroup CoX_Peripheral_Lib
//! @{
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup AU9110_xPort
//! \brief CoX通用强制接口定义到MCU专有接口定义的转换层。
//!
//! CoX通用接口有些是不需要在转换层重新定义的，比如在xgpio.h中有如下定义：
//! #define xGPIO_DIR_MODE_IN       GPIO_DIR_MODE_IN
//! 而GPIO_DIR_MODE_IN这个宏在gpio.h中已经定义好了，如下，
//! #define GPIO_DIR_MODE_IN        0x00000000
//! 所以此时不在需要在这个转换层中做任何宏定义接口的转换对接。
//!
//! 而有些通用强制接口定义的宏在MCU专有接口里没有与其名称完全相符的宏定义，并且这个宏表示的功能在这个MCU中的确有
//! （即应用程序可能会使用这个接口），这个时候就需要在这个转换层中进行相关的宏定义转换或者直接定义一遍。
//! 比如在xSysCtl.h中 WDOG的定义如下
//! #define xSYSCTL_PERIPH_WDOG     SYSCTL_PERIPH_WDT
//! 在sysctl.h中WDT外设ID的定义为 ，
//! #define SYSCTL_PERIPH_WDG       0x00000010
//! 所以此时在这个文件中需要有如下的转换定义：
//! #define SYSCTL_PERIPH_WDT      SYSCTL_PERIPH_WDG
//! 或者直接如下定义：
//! #define SYSCTL_PERIPH_WDT       0x00000010
//!
//! @{
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xLowlayer
//! @{
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xLowlayer_Memmap_Port Memory port
//! @{
//
//*****************************************************************************

//
//! DMA memory map port
//
#define DMA0_BASE               PDMA0_BASE
#define DMA1_BASE               PDMA1_BASE
#define DMA2_BASE               PDMA2_BASE
#define DMA3_BASE               PDMA3_BASE

//
//! I2C memory map port
//
#define I2S0_BASE               I2S_BASE

//
//! ADC memeory map port
//
#define ADC0_BASE               ADC_BASE

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xLowlayer_Int_Assignment_Port Int assignment port
//! @{
//
//*****************************************************************************

//
//! GPIO interrupt ID port
//
#define INT_GPIOA               INT_GPIOAB
#define INT_GPIOB               INT_GPIOAB

//
//! DMA interrupt ID port
//
#define INT_DMA0                INT_PDMA
#define INT_DMA1                INT_PDMA
#define INT_DMA2                INT_PDMA

//
//! I2S interrupt ID port
//
#define INT_I2S0                INT_I2S

//
//! ADC interrupt ID port
//
#define INT_ADC0                INT_ADC

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xSysCtl
//! @{
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xSysCtl_Peripheral_ID_Port Peripheral ID port
//! @{
//
//*****************************************************************************

//
//! ADC peripheral ID port
//
#define SYSCTL_PERIPH_ADC0      SYSCTL_PERIPH_ADC

//
//! DMA peripheral ID port
//
#define SYSCTL_PERIPH_DMA0      SYSCTL_PERIPH_PDMA

//
//! PWM peripheral ID port
//
#define SYSCTL_PERIPH_PWMA      SYSCTL_PERIPH_PWM01

//
//! Timer0 peripheral ID port
//
#define SYSCTL_PERIPH_TIMER0    SYSCTL_PERIPH_TMR0

//
//! Timer1 peripheral ID port
//
#define SYSCTL_PERIPH_TIMER1    SYSCTL_PERIPH_TMR1

//
//! I2S0 peripheral ID port
//
#define SYSCTL_PERIPH_I2S0      SYSCTL_PERIPH_I2S

//
//! WDOG peripheral ID port
//
#define SYSCTL_PERIPH_WDT      SYSCTL_PERIPH_WDG

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xSysCtl_HCLK_set_Port HCLK set Port
//! @{
//
//*****************************************************************************

//
//! Internal RC
//
#define SYSCTL_OSC_INT          SYSCTL_OSC_49M_EN

//
//! SYSCTL_PLL_INT
//
#define SYSCTL_PLL_INT          0


//
//! Internal 10K RC
//
#define SYSCTL_OSC_INTSL        SYSCTL_OSC_16K_EN

//
//! External Oscillator 32.768K
//
#define SYSCTL_OSC_EXTSL        SYSCTL_OSC_XTAL32K_EN


//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xGPIO_Port xGPIO Port
//! @{
//
//*****************************************************************************


//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xRTC_Port xRTC port
//! @{
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xRTC_INT_Type_Port RTC INT Type Port
//! @{
//
//*****************************************************************************

//
//! RTC Time Tick Interrupt
//
#define RTC_INT_SECOND         RTC_INT_TIME_TICK

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xWDT_Port xWDT port
//! @{
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup xWDT_Clock_Config_Port xWDT Clock Config Port
//! @{
//
//*****************************************************************************

//
//! Use Internal RC Clock as WDT clock source.
//
#define WDT_S_INTSL             0x00000003

//
//! Use External RTC Clock as WDT clock source.
//
#define WDT_S_EXTSL             0x00000001

//
//! The watch dog source is the HCLK/2048
//
#define WDT_S_HCLK_DIV          0x00000002

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
//! @}
//
//*****************************************************************************


#endif
